/**
 * Существует парковка для грузовых и легковых машин. Количество парковочных
 * мест для каждого типа машин задается на этапе создания парковки.
 * <p>
 * Легковая машина может занять только место, предназначенное для легковой машины.
 * Грузовая машина может разместиться на месте, предназначенном для грузовых
 * машин, либо на N парковочных мест для легковых машин, стоящих рядом.
 * <p>
 * Важно! Легковой считается машина у которой размер равен 1.
 * Грузовой у которой размер {@literal >}1.
 * <p>
 * Необходимо разработать сервис для учета парковки машин.
 *
 * @author ViktorJava (gipsyscrew@gmail.com)
 * @version 0.1
 * @since 20.11.2021
 */
package ru.job4j.lsp.parking;
